SisGPWeb/app/controllers/atividades_controller.rb

SELECT "atividades".* FROM "atividades"
---
  def index
    @atividades = Atividade.all

INSERT INTO "atividades" ("nome", "descricao", "dataInicio", "dataFim", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", ""], ["descricao", ""], ["dataInicio", "2016-04-04"], ["dataFim", "2016-04-04"], ["created_at", "2016-04-04 18:57:54.280918"], ["updated_at", "2016-04-04 18:57:54.280918"]]
---
  def create
    @atividade = Atividade.new(atividade_params)


    respond_to do |format|
      if @atividade.save

DELETE FROM "atividades" WHERE "atividades"."id" = ?  [["id", 980190962]]
---
  def destroy
    @atividade.destroy

SELECT  "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_atividade
      @atividade = Atividade.find(params[:id])