SisGPWeb/app/controllers/processos_controller.rb

SELECT "processos".* FROM "processos"
---
  def index
    @processos = Processo.all

INSERT INTO "processos" ("nome", "descricao", "dataInicio", "dataFim", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "MyString"], ["descricao", "MyText"], ["dataInicio", "2016-04-03"], ["dataFim", "2016-04-03"], ["created_at", "2016-04-26 15:02:43.309294"], ["updated_at", "2016-04-26 15:02:43.309294"]]
---
  def create

    @processo = Processo.new(processo_params)

    respond_to do |format|
      if @processo.save

DELETE FROM "processos" WHERE "processos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @processo.destroy

SELECT  "processos".* FROM "processos" WHERE "processos"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_processo
      @processo = Processo.find(params[:id])