SisGPWeb/app/controllers/projetos_controller.rb

SELECT "projetos".* FROM "projetos"
---
  def index
    @projetos = Projeto.all

INSERT INTO "projetos" ("nome", "descricao", "dataInicio", "dataFim", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "MyString"], ["descricao", "MyText"], ["dataInicio", "2016-04-03"], ["dataFim", "2016-04-03"], ["created_at", "2016-04-26 12:55:27.973220"], ["updated_at", "2016-04-26 12:55:27.973220"]]
---
  def create
    @projeto = Projeto.new(projeto_params)

    respond_to do |format|
      if @projeto.save

UPDATE "projetos" SET "nome" = ?, "descricao" = ?, "updated_at" = ? WHERE "projetos"."id" = ?  [["nome", "João Henrique"], ["descricao", "jjjjhncodnvw"], ["updated_at", "2016-04-04 04:00:10.572311"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @projeto.update(projeto_params)

DELETE FROM "projetos" WHERE "projetos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @projeto.destroy

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_projeto
      @projeto = Projeto.find(params[:id])