SisGPWeb/app/views/processos/index.html.erb

          <div class="collapsible-body">
            <% processo.atividades.each do |atividade| %>
---
SELECT "atividades".* FROM "atividades" WHERE "atividades"."processo_id" = ?  [["processo_id", 298486374]]